Revit 2027 API
IntersectionResultArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IntersectionResultArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As IntersectionResultArrayIterator
public:
virtual IntersectionResultArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> IntersectionResultArrayIterator
override ForwardIterator : unit -> IntersectionResultArrayIterator
Return Value
IntersectionResultArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
IntersectionResultArray Class
Autodesk.Revit.DB Namespace